tutorials/interDyMFoam/sloshingTank/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            patch;
        nFaces          148;
        startFace       2646;
    }
    front
    {
        type            empty;
        nFaces          1360;
        startFace       2794;
    }
    back
    {
        type            empty;
        nFaces          1360;
        startFace       4154;
    }
)

// ************************************************************************* //
